server/ruby/rovi/get_service_details_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthHeader xmlns="http://services.macrovision.com/v9/common/types">
      <UserName>spencerward4eb3ss7uuq43s42uhvrj46mp</UserName>
      <Password>eec71e29-2b15-4331-bfd4-1673e36dd6f4</Password>
    </AuthHeader>
  </soap:Header>
  <soap:Body>
    <GetServiceDetails xmlns="http://services.macrovision.com/v9/listings">
      <request>
        <Locale>en-GB</Locale>
        <ServiceId>891296</ServiceId>
        <Duration>600</Duration>
      </request>
    </GetServiceDetails>
  </soap:Body>
</soap:Envelope>